Catalogs/фин_ПричиныОтклоненийФактическихДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>фин_ПричиныОтклоненийФактическихДанных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВлиянияНаФинансовыйРезультат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ВидыВлиянияОтклонений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтклонения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ВидыОтклоненийФактическихДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеОтклонение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтруктурногоОтклонения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ВидыСтруктурныхОтклонений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/фин_ПричиныОтклоненийФактическихДанных/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ВидСтруктурногоОтклонения.Видимость = Объект.СтруктурноеОтклонение;
	Если НЕ Объект.Ссылка.Пустая() Тогда
		РазрешеноИзменение = Справочники.фин_ПричиныОтклоненийФактическихДанных.РазрешеноИзменятьСтруктурныеХарактеристикиОтклонения(Объект);
		Элементы.СтруктурноеОтклонение.ТолькоПросмотр = НЕ РазрешеноИзменение;
		Элементы.ВидСтруктурногоОтклонения.ТолькоПросмотр = НЕ РазрешеноИзменение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтруктурноеОтклонениеПриИзменении(Элемент)
	Элементы.ВидСтруктурногоОтклонения.Видимость = Объект.СтруктурноеОтклонение;
	Если НЕ Объект.СтруктурноеОтклонение Тогда
		Объект.ВидСтруктурногоОтклонения = ПредопределенноеЗначение("Перечисление.фин_ВидыСтруктурныхОтклонений.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры
